WebApp/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ";;n;"], ["age", 88], ["created_at", "2018-10-02 10:47:54.082309"], ["updated_at", "2018-10-02 10:47:54.082309"]]
---
  def create
    User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 0], ["updated_at", "2018-10-03 17:27:12.281471"], ["id", 6]]
---
  def update
    user = User.find(params[:id])
    user.update(user_params)